# 1. Series

- pandas.Series(data=None, index=None, dtype=None, name=None, copy=None, fastpath=<no_default>)

In [1]:
import pandas as pd

In [2]:
dict1={"Key1":"value1","Key2":"value2"}

a=pd.Series(dict1)

print(a)

Key1    value1
Key2    value2
dtype: object

In [3]:
a["Key1"]

'value1'

In [4]:
print(type(a))

<class 'pandas.core.series.Series'>

In [5]:
#pd.Series(data,index)
labels=['a','b','c']
data=[1,"String",2]

pd.Series(data,labels)

a         1
b    String
c         2
dtype: object

### Operations

In [6]:
ser1=pd.Series([1,2,3,4,5],index=['USA',"GERMANY","USSR","JAPAN","Italy"],)
ser2=pd.Series([4,5,6,7],index=['USA',"GERMANY","USSR","JAPAN"])

ser1+ser2

GERMANY     7.0
Italy       NaN
JAPAN      11.0
USA         5.0
USSR        9.0
dtype: float64

In [7]:
ser1["USA"]

1

In [8]:
ser1[0]

1

# 2. DATAFRAME

In [9]:
import numpy as np

np.random.seed(101)

df=pd.DataFrame(np.random.randn(5,4),index=["A","B","C","D","E"],columns=["col1","col2","col3","col4"])
df

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
type(df)

pandas.core.frame.DataFrame

## 2.1 Indexing Columns

- Directly using names
- df[colname]

In [11]:
df['col1']  #columns

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: col1, dtype: float64

## 2.2 Indexing Rows

- Using rowname 
    - df.loc[rowname]
- Using rownumber 
    - df.iloc[rownumber]

In [12]:
df.loc['A']
#or
df.iloc[0]

col1    2.706850
col2    0.628133
col3    0.907969
col4    0.503826
Name: A, dtype: float64

## 2.3 Indexing each element

- df.loc[rowname][colname]
- df.iloc[rownum][colnum]

In [13]:
df.loc['A'][0]

2.706849839399938

In [14]:
df.iloc[1][2]

-0.8480769834036315

# 2.4 Slicing


dataframe [ rowstart:rowstop:rowstep,  colstart:colstop:colstep]

In [59]:
df.iloc[0:3,[3,1,0]]

       col4      col2      col1
A  0.503826  0.628133  2.706850
B  0.605965 -0.319318  0.651118
C -0.589001  0.740122 -2.018168

In [60]:
df.loc[["A","B"],["col1","col3"]]

       col1      col3
A  2.706850  0.907969
B  0.651118 -0.848077

In [61]:

df=pd.DataFrame(np.random.randn(5,4),index=["A","B","C","D","E"],columns=["col1","col2","col3","col4"])
df

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## 2.5 Add new Columns

In [62]:
df["new"]=df["col1"]+df["col2"]

In [63]:
df

       col1      col2      col3      col4       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

### 2.6 Drop Columns or Rows

In [64]:
df.drop('new',axis=1,inplace=True)

In [65]:
df

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [66]:
df.drop("E",axis=0)

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [67]:
df

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
df.shape

(5, 4)

### 2.7 Add New Rows

In [69]:
df.loc["T"]={"col1":1,"col2":2,"col3":4,"col4":4}

In [70]:
df

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652
T  1.000000  2.000000  4.000000  4.000000

In [71]:
df.loc["U"]=df.loc["A"]+df.loc["B"]

In [72]:
df

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652
T  1.000000  2.000000  4.000000  4.000000
U  0.167825  2.084251 -1.539181 -0.974618

## 2.8 Conditional Selection

In [73]:
print(df)
df[df['col1']>0]

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652
T  1.000000  2.000000  4.000000  4.000000
U  0.167825  2.084251 -1.539181 -0.974618

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646
T  1.000000  2.000000  4.000000  4.000000
U  0.167825  2.084251 -1.539181 -0.974618

In [74]:
df[(df['col1']>0) & (df['col2']>1)]

       col1      col2      col3      col4
A  0.302665  1.693723 -1.706086 -1.159119
T  1.000000  2.000000  4.000000  4.000000
U  0.167825  2.084251 -1.539181 -0.974618

## 2.9 Cleaning

In [75]:
import numpy as np
dict1={'A':[1,2,np.nan],'B':[5,np.nan,np.nan]}
df1=pd.DataFrame(dict1)

In [76]:
df1.isna()

       A      B
0  False  False
1  False   True
2   True   True

In [77]:
df2=df1.fillna(df1['A'].mean())

df2

     A    B
0  1.0  5.0
1  2.0  1.5
2  1.5  1.5

## 2.10 Groupby

In [78]:
df=pd.DataFrame({'Company':['Goog','Goog','MSFT','MSFT','TCS','TCS'],"Sales":[200,200,340,124,56,78]})
df

  Company  Sales
0    Goog    200
1    Goog    200
2    MSFT    340
3    MSFT    124
4     TCS     56
5     TCS     78

In [79]:
df.groupby('Company')['Sales'].mean()

Company
Goog    200.0
MSFT    232.0
TCS      67.0
Name: Sales, dtype: float64

# 2.11 Attributes

In [80]:
df['Company'].nunique()

3

In [81]:
df['Sales'].value_counts()

200    2
340    1
124    1
56     1
78     1
Name: Sales, dtype: int64